import React from "react";
import "../footerCss/Privacy.css";

const Privacy = () => {
  return (
    <div className="privacy-container">
      <h1 className="privacy-title">개인정보 처리방침</h1>
      <div className="privacy-content">
        <p>
          (주) 인베이드게이트 (이하 ‘회사’)는 이용자의 개인정보 보호를 매우
          중요하게 생각하며, 이용자가 회사의 서비스를 이용하기 위해 회사에
          제공한 개인정보 보호에 최선을 다하고 있습니다. 이에 회사는
          "정보통신망 이용촉진 및 정보보호 등에 관한 법률" 및 "개인정보 보호법"
          등 개인정보 보호와 관련된 법령을 준수하고 있습니다.
        </p>
        <p>
          회사는 본 개인정보처리방침을 사이트 첫 화면에 공개함으로써 이용자가
          언제든지 쉽게 확인할 수 있도록 하고 있습니다.
        </p>
        <p>
          본 개인정보처리방침은 관계 법령 및 회사의 내부 방침에 따라 변경될 수
          있으며, 개정 시 버전 관리를 통하여 개정사항을 쉽게 확인할 수 있도록
          하고 있습니다.
        </p>
        <h2>제1조(수집하는 개인정보 항목)</h2>
        <p>회사에서 수집하는 개인정보 항목은 다음과 같습니다.</p>
        <h3>1. 회원가입 및 인베이드게이트. 서비스 이용시 필요한 개인정보 항목</h3>
        <p>
          1)회원관리 - 서비스 이용에 따른 본인확인 및 개인 식별
          <ol>
            <li>불량회원의 부정이용 방지와 비인가 사용 방지 및 중복가입방지</li>
            <li>가입의사 확인, 가입 및 가입횟수 제한</li>
            <li>회원상담 진행, 회원불만 접수 및 처리, 분쟁조정을 위한 기록보존</li>
            <li>
              만 19세 미만 미성년자 개인정보 수집 시 법정대리인 동의 여부 확인,
              법정대리인 권리행사 시 본인확인
            </li>
            <li>공지사항 전달</li>
          </ol>
        </p>
        <p>
          2)신규 서비스 개발 및 마케팅, 광고
          <ol>
            <li>신규 서비스(제품) 개발 및 특화</li>
            <li>인구통계학적 특성에 따른 서비스 제공 및 광고 게재</li>
            <li>접속 빈도 파악</li>
            <li>서비스의 이용실적 분석</li>
            <li>회원의 서비스 이용에 대한 통계</li>
            <li>이벤트 등 광고성 정보 전달</li>
            <li>새로운 서비스 및 상품 안내</li>
          </ol>
        </p>
        <p>
          원칙적으로 회사는 회원의 개인정보를 수집 및 이용목적에 한해서만
          이용하며 타인 또는 타기업/기관에 공개하지 않습니다. 다만, 아래의
          경우에는 예외로 합니다.
          <ol>
            <li>정보주체로부터 별도의 동의를 받은 경우</li>
            <li>
              법률에 특별한 규정이 있거나 법령상 의무를 준수하기 위하여 불가피한
              경우
            </li>
            <li>
              정보주체 또는 그 법정대리인이 의사표시를 할 수 없는 상태에 있거나
              주소불명 등으로 사전 동의를 받을 수 없는 경우로서 명백히 정보주체
              또는 제3자의 급박한 생명, 신체, 재산의 이익을 위하여 필요하다고
              인정되는 경우
            </li>
            <li>
              통계작성 및 학술연구 등의 목적을 위하여 필요한 경우로서 특정 개인을
              알아볼 수 없는 형태로 개인정보를 제공하는 경우
            </li>
            <li>범죄의 수사와 공소의 제기 및 유지를 위하여 필요한 경우</li>
            <li>업무상 연락을 위하여 회원의 정보(이름, 주소, 휴대전화, 전화번호)를 사용하는 경우</li>
          </ol>
        </p>
        <h2>제2조(개인정보의 처리목적)</h2>
        <p>회사는 위 제1항과 같은 ‘개인정보의 수집 및 이용목적’을 위하여 아래와 같은 원칙에 의하여 개인정보를 수집하고 있습니다.</p>
        <h3>1. 수집 개인정보 항목</h3>
        <p>
          해당 서비스의 본질적 기능을 수행하기 위한 정보는 필수정보로서 수집하며 회원이 그 정보를 회사에 제공하지 않는 경우 서비스 이용에 제한이 가해질 수 있지만, 선택정보 즉, 보다 특화된 서비스를 제공하기 위해 추가 수집되는 정보의 경우에는 이를 입력하지 않은 경우에도 서비스 이용제한은 없습니다. 서비스 이용에 따라 다음과 같은 정보를 수집합니다.
          <ol>
            <li>회원 가입 시 수집항목 - 이메일, 휴대폰번호, 이름, 닉네임</li>
            <li>만 19세 미만 미성년자 이용계약 시 수집항목 - 담당자 이름, 전화번호, 이메일, 법정대리인 동의서</li>
            <li>증권사와 연동된 포트폴리오 서비스 제공을 위해 계좌 번호 정보를 수집합니다. 또한 포트폴리오 서비스 제공을 위해 보유 증권의 수량 및 평균단가 정보를 수집합니다.</li>
            <li>회사는 공동인증서 등의 개인 식별키를 일체 서버에 저장하지 않으며, 회원의 디바이스 내에서만 이중암호화하여 안전하게 관리됩니다.</li>
            <li>그 외 부가서비스 서비스 신청 시 수집항목 - 부가서비스 신청 과정에서 개인정보 중 일부 항목을 추가 수집할 수 있으며, 수집항목은 각 부가서비스 신청 페이지 개인정보 수집 및 이용 동의 영역의 별도 항목으로 대체합니다.</li>
            <li>상담 및 민원사항 처리 시 - 로그인 아이디, 이름, 이메일, 연락처, 개별 서비스 계정 아이디 및 비밀번호(테스트, 계정 연동 필요 시), 사업자등록증 등 증빙서류, 계좌정보(거래은행명, 계좌번호, 예금주 성명)</li>
            <li>기타 수집항목 : 서비스 이용기록, 접속 로그, 쿠키, 접속 IP정보, 결제 기록</li>
            <li>타사 계정을 이용한 회원가입 시 아래와 같이 제3자로부터 개인정보를 제공받습니다. - 카카오: [필수]카카오계정(이메일), 프로필 정보(닉네임/프로필 사진), 카카오 계정 식별자</li>
            <li>구글: [필수]이메일주소, 닉네임, 구글 계정 식별자</li>
          </ol>
        </p>
        <h3>2. 개인정보 수집 방법</h3>
        <p>
          회사는 다음과 같은 방법으로 개인정보를 수집합니다.
          <ol>
            <li>홈페이지 회원 가입 시점</li>
            <li>홈페이지 내 부가서비스 별 페이지</li>
            <li>전화, 채팅, 이메일을 통한 회원상담 및 서비스 이용관리</li>
            <li>증권사 연동 기능 사용시</li>
          </ol>
        </p>
        <h2>제3조(개인정보의 보유 및 이용기간)</h2>
        <p>① 회사는 법령에 따른 개인정보 보유·이용기간 또는 이용자로부터 개인정보의 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리합니다.</p>
        <p>② 각각의 개인정보 보유 및 이용기간은 다음과 같습니다.</p>
        <h3>1. 인베이드게이트. 서비스 사용시 수집된 개인정보의 보유 및 이용기간</h3>
        <p>회원가입</p>
        <ol style={{color:'#fff'}}>
          <li>보유사유: 회원 관리, 이용자 상담 및 민원처리</li>
          <li>이용기간: 회원탈퇴 시 다만, 관계 법령 위반에 따른 수사·조사 등이 진행 중인 경우에는 해당 수사·조사 종료 시까지 보유 및 이용합니다.</li>
        </ol>
        <h3>2. 재화 또는 서비스 제공에 따른 법률에 의한 보존</h3>
        <p>
          소비자의 불만 또는 분쟁처리에 관한 기록
          <ol>
            <li>이용기간: 3년</li>
            <li>표시·광고에 관한 기록</li>
            <li>이용기간: 6개월</li>
            <li>로그인 기록</li>
            <li>관련법률: 통신비밀보호법</li>
            <li>이용기간: 3개월</li>
          </ol>
        </p>
        <h2>제4조(개인정보의 파기 절차 및 방법)</h2>
        <p>회사는 개인정보 보유기간의 경과, 처리 목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체 없이 해당 개인정보를 파기합니다.</p>
        <h3>1. 파기 절차</h3>
        <p>회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.</p>
        <h3>2. 파기 방법</h3>
        <p>회사는 전자적 파일 형태로 기록된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.</p>

        <h2>부칙</h2>
        <p>최초 게시일 : 2024년 07월 30일</p>
        <p>최종 개정일 : 2024년 07월 31일</p>

      </div>

      
    </div>
  );
};

export default Privacy;
